soap_requests/UpdateSecret.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <UpdateSecret xmlns="urn:thesecretserver.com">
      <token>{{ cur_user_token[0] }}</token>
      <secret>
        <Name>{{ secret_name }}</Name>
        <Items>
          <SecretItem>
            <Value>{{ secret_value}}</Value>
            <Id>{{ secret_id }}</Id>
            <FieldId>{{ secret_field_id }}</FieldId>
            <FieldName>{{ secret_field }}</FieldName>
            <IsFile>{{ secret_is_file|lower }}</IsFile>
            <IsNotes>{{ secret_is_notes|lower }}</IsNotes>
            <IsPassword>{{ secret_is_password|lower }}</IsPassword>
            <FieldDisplayName>{{ secret_field_display_name }}</FieldDisplayName>
          </SecretItem>
        </Items>
        <Id>{{ secret_id }}</Id>
        <FolderId>{{ get_secret_folder_id[0] }}</FolderId>
      </secret>
    </UpdateSecret>
  </soap:Body>
</soap:Envelope>